index=* sourcetype="WinEventLog:Security" EventCode=4723 cyberspace1
| eval user=coalesce(Account_Name, Target_Account_Name, User_Name)
| fields _time, user, host, EventCode, Message
| table _time, user, host, EventCode, Message
| rename _time as "Password Change Time", host as "Domain Controller"













index=wineventlog sourcetype="WinEventLog:Security" EventCode=4723 (Account_Name="cyberspace1" OR Target_Account_Name="cyberspace1")
| eval user=coalesce(Account_Name, Target_Account_Name)
| fields _time, user, host, EventCode, Message
| join host, user max=0
    [ search index=wineventlog sourcetype="WinEventLog:Security" EventCode=4624 (Account_Name="cyberspace1" OR Target_Account_Name="cyberspace1") Logon_Type=2 OR Logon_Type=10
    | eval ip_address=coalesce(Source_Network_Address, Network_Address)
    | fields _time, host, user, ip_address ]
| table _time, user, ip_address, host, EventCode, Message
| rename _time as "Password Change Time", host as "Domain Controller"

(index=wineventlog sourcetype="WinEventLog:Security" EventCode=4723 (Account_Name="cyberspace1" OR Target_Account_Name="cyberspace1")) OR (index=azure sourcetype="ms:aad:audit" operationName="Update user" properties.targetResources{}.userPrincipalName="cyberspace1@*")
| eval user=case(sourcetype="WinEventLog:Security", coalesce(Account_Name, Target_Account_Name), sourcetype="ms:aad:audit", properties.targetResources{}.userPrincipalName)
| fields _time, user, host, EventCode, operationName, Message
| join user max=0
    [ search (index=wineventlog sourcetype="WinEventLog:Security" EventCode=4624 (Account_Name="cyberspace1" OR Target_Account_Name="cyberspace1") Logon_Type=2 OR Logon_Type=10) OR (index=azure sourcetype="ms:aad:signin" userPrincipalName="cyberspace1@*")
    | eval ip_address=case(sourcetype="WinEventLog:Security", coalesce(Source_Network_Address, Network_Address), sourcetype="ms:aad:signin", ipAddress)
    | fields _time, user, ip_address ]
| table _time, user, ip_address, host, EventCode, operationName
| rename _time as "Password Change Time", host as "Domain Controller"







index=your_index_name sourcetype=WinEventLog:Security (EventCode=4723 OR EventCode=4724)
| rename SubjectLogonId as logon_id
| join logon_id [ search index=your_index_name sourcetype=WinEventLog:Security EventCode=4624 
  | rename SubjectLogonId as logon_id 
  | table logon_id SourceNetworkAddress ]
| table _time EventCode TargetUserName SubjectUserName SourceNetworkAddress
